bench-results/zcnblk0-fan-zcbrd-smoke-20260604T174457Z/fio-randwrite.log
zcnblk0-fan-randwrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=io_uring, iodepth=16
...
fio-3.39
Starting 8 processes

zcnblk0-fan-randwrite: (groupid=0, jobs=8): err= 0: pid=2809712: Thu Jun  4 13:45:02 2026
  write: IOPS=201k, BW=787MiB/s (825MB/s)(2363MiB/3002msec); 0 zone resets
    slat (nsec): min=390, max=25420, avg=553.02, stdev=114.32
    clat (usec): min=86, max=6192, avg=634.25, stdev=96.66
     lat (usec): min=87, max=6192, avg=634.80, stdev=96.67
    clat percentiles (usec):
     |  1.00th=[  482],  5.00th=[  537], 10.00th=[  611], 20.00th=[  619],
     | 30.00th=[  627], 40.00th=[  627], 50.00th=[  627], 60.00th=[  635],
     | 70.00th=[  635], 80.00th=[  644], 90.00th=[  652], 95.00th=[  725],
     | 99.00th=[  881], 99.50th=[  922], 99.90th=[ 1074], 99.95th=[ 1401],
     | 99.99th=[ 4424]
   bw (  KiB/s): min=790304, max=830440, per=100.00%, avg=806481.33, stdev=2628.29, samples=48
   iops        : min=197576, max=207610, avg=201620.33, stdev=657.07, samples=48
  lat (usec)   : 100=0.01%, 250=0.02%, 500=2.32%, 750=93.09%, 1000=4.43%
  lat (msec)   : 2=0.09%, 4=0.02%, 10=0.03%
  cpu          : usr=1.12%, sys=2.59%, ctx=560252, majf=0, minf=72
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,604861,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=787MiB/s (825MB/s), 787MiB/s-787MiB/s (825MB/s-825MB/s), io=2363MiB (2478MB), run=3002-3002msec

Disk stats (read/write):
  zcnblk0: ios=0/582398, sectors=0/4659184, merge=0/0, ticks=0/366698, in_queue=366698, util=100.00%